In [2]:
import pandas as pd  
import numpy as np  
info = np.array(['P','a','n','d','a','s'])  
a = pd.Series(info)  
print(a)

0    P
1    a
2    n
3    d
4    a
5    s
dtype: object

In [4]:
import pandas as pd  
# a list of strings  
x = ['Python', 'Pandas']  
# Calling DataFrame constructor on list  
df = pd.DataFrame(x)  
print(df)

        0
0  Python
1  Pandas

In [5]:
import pandas as pd
s = pd.Series()
print(s)

Series([], dtype: float64)

/Users/vikashagrawal/opt/anaconda3/envs/dev/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [6]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [10]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [11]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [12]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
print(s)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [13]:
s = pd.Series(5, index=[0, 1, 2, 3])
print(s)

0    5
1    5
2    5
3    5
dtype: int64

In [15]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
#retrieve the first element
print(s[0])

1

In [16]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[:3])

a    1
b    2
c    3
dtype: int64

In [19]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[-3:])

c    3
d    4
e    5
dtype: int64

In [21]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s['a'])

1

In [41]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[['a','c','d']])

a    1
c    3
d    4
dtype: int64

In [27]:
#error if label not present
#s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
#print(s['f'])

In [42]:
print(s.dtype)   
print(s.shape)  
print(s.size)
print(s.empty)
print(s.hasnans)
print(s.ndim)
print(len(s))
print(s.count())

int64
(5,)
5
False
False
1
5
5

In [40]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
print(s.hasnans)
print(len(s)) #index count
print(s.count()) #data count

True
4
3

In [52]:
#create DF from series
comp_name = ['Maruti Suzuki India Ltd.', 'HDFC Bank Ltd.', 'Infosys Ltd.', 'HCL Infosystems Ltd.']   
comp_id = [13000, 10010, 20002, 17902]     
cname_series = pd.Series(comp_name)   
cid_series = pd.Series(comp_id)     
frame = { 'Name': cname_series, 'ID': cid_series }   
result = pd.DataFrame(frame)     
print(result)

                       Name     ID
0  Maruti Suzuki India Ltd.  13000
1            HDFC Bank Ltd.  10010
2              Infosys Ltd.  20002
3      HCL Infosystems Ltd.  17902

In [44]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)

Empty DataFrame
Columns: []
Index: []

In [45]:
# a list of strings  
x = ['Python', 'Pandas']   
df = pd.DataFrame(x)  
print(df)

        0
0  Python
1  Pandas

In [47]:
data = [['Maruti Suzuki India Ltd',13000],['HDFC Bank Ltd',10010],['Infosys Ltd.',20002]]
df = pd.DataFrame(data,columns=['Comp Name','Comp Code'],dtype=float)
print(df)

                 Comp Name  Comp Code
0  Maruti Suzuki India Ltd    13000.0
1            HDFC Bank Ltd    10010.0
2             Infosys Ltd.    20002.0

In [71]:
data = {'Comp Name':['Maruti Suzuki India Ltd.', 'HDFC Bank Ltd.', 'Infosys Ltd.', 'HCL Infosystems Ltd.'],'Comp Code':[13000, 10010, 20002, 17902]}
df = pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

                      Comp Name  Comp Code
rank1  Maruti Suzuki India Ltd.      13000
rank2            HDFC Bank Ltd.      10010
rank3              Infosys Ltd.      20002
rank4      HCL Infosystems Ltd.      17902

In [61]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [56]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df
df['three']=pd.Series([10,20,30],index=['a','b','c'])
df
df['four']=df['one']+df['three']
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [59]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
df
del df['one']
df
df.pop('two')
df

Our dataframe is:

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [66]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
print(df.loc['b'])
print(df.iloc[2])
print (df[0:2])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
one    2.0
two    2.0
Name: b, dtype: float64
one    3.0
two    3.0
Name: c, dtype: float64
   one  two
a  1.0    1
b  2.0    2

In [81]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print(df)
# Drop rows with label 0
df = df.drop(0)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8
   a  b
1  3  4
1  7  8

In [82]:
data = {'Comp Name':['Maruti Suzuki India Ltd.', 'HDFC Bank Ltd.', 'Infosys Ltd.', 'HCL Infosystems Ltd.'],'Comp Code':[13000, 10010, 20002, 17902],
       'm_cap':[266765.07, 773575.65, 633793.90, 553.07]}
df = pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

                      Comp Name  Comp Code      m_cap
rank1  Maruti Suzuki India Ltd.      13000  266765.07
rank2            HDFC Bank Ltd.      10010  773575.65
rank3              Infosys Ltd.      20002  633793.90
rank4      HCL Infosystems Ltd.      17902     553.07

In [83]:
df.T

,rank1,rank2,rank3,rank4
Comp Name,Maruti Suzuki India Ltd.,HDFC Bank Ltd.,Infosys Ltd.,HCL Infosystems Ltd.
Comp Code,13000,10010,20002,17902
m_cap,266765,773576,633794,553.07

In [84]:
df.axes

[Index(['rank1', 'rank2', 'rank3', 'rank4'], dtype='object'),
 Index(['Comp Name', 'Comp Code', 'm_cap'], dtype='object')]

In [85]:
df.head()

                      Comp Name  Comp Code      m_cap
rank1  Maruti Suzuki India Ltd.      13000  266765.07
rank2            HDFC Bank Ltd.      10010  773575.65
rank3              Infosys Ltd.      20002  633793.90
rank4      HCL Infosystems Ltd.      17902     553.07

In [86]:
df.tail(2)

                  Comp Name  Comp Code      m_cap
rank3          Infosys Ltd.      20002  633793.90
rank4  HCL Infosystems Ltd.      17902     553.07

In [87]:
df.dtypes

Comp Name     object
Comp Code      int64
m_cap        float64
dtype: object

In [88]:
df.empty

False

In [89]:
df.ndim

2

In [90]:
df.shape

(4, 3)

In [91]:
df.size

12

In [92]:
df.values

array([['Maruti Suzuki India Ltd.', 13000, 266765.07],
       ['HDFC Bank Ltd.', 10010, 773575.65],
       ['Infosys Ltd.', 20002, 633793.9],
       ['HCL Infosystems Ltd.', 17902, 553.07]], dtype=object)

In [97]:
df.sum()

Comp Name    Maruti Suzuki India Ltd.HDFC Bank Ltd.Infosys ...
Comp Code                                                60914
m_cap                                              1.67469e+06
dtype: object

In [106]:
d = {'Name':pd.Series(['a','b','c','d','e','f','g',
   'h','i','j','k','l']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,6.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
df = pd.DataFrame(d)
df.sum()

Name      abcdefghijkl
Age                382
Rating           47.92
dtype: object

In [100]:
df.sum(1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [101]:
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [102]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

In [103]:
df.count()

Name      12
Age       12
Rating    12
dtype: int64

In [104]:
df.min()

Name         a
Age         23
Rating    2.56
dtype: object

In [110]:
df.max()

Name         l
Age         51
Rating    6.24
dtype: object

In [111]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.993333
std     9.232682   0.955618
min    23.000000   2.560000
25%    25.000000   3.537500
50%    29.500000   3.890000
75%    35.500000   4.322500
max    51.000000   6.240000

       Name
count    12
unique   12
top       a
freq      1

In [128]:
df = pd.DataFrame([[1, 2], [3],[9],[5],[6]], columns = ['a','b'])
df2 = pd.DataFrame([[ np.nan,6], [7, 8]], columns = ['a','b'])

df = df.append(df2)#,ignore_index=True)
print(df)

     a    b
0  1.0  2.0
1  3.0  NaN
2  9.0  NaN
3  5.0  NaN
4  6.0  NaN
0  NaN  6.0
1  7.0  8.0

In [129]:
df.reset_index()

   index    a    b
0      0  1.0  2.0
1      1  3.0  NaN
2      2  9.0  NaN
3      3  5.0  NaN
4      4  6.0  NaN
5      0  NaN  6.0
6      1  7.0  8.0

In [130]:
df.ffill()

     a    b
0  1.0  2.0
1  3.0  2.0
2  9.0  2.0
3  5.0  2.0
4  6.0  2.0
0  6.0  6.0
1  7.0  8.0

In [132]:
df.ffill(limit=2)

     a    b
0  1.0  2.0
1  3.0  2.0
2  9.0  2.0
3  5.0  NaN
4  6.0  NaN
0  6.0  6.0
1  7.0  8.0

In [134]:
df.rename(columns={"a": "a_new"}, inplace=True)

In [135]:
df

   a_new    b
0    1.0  2.0
1    3.0  NaN
2    9.0  NaN
3    5.0  NaN
4    6.0  NaN
0    NaN  6.0
1    7.0  8.0

In [136]:
for col in df:
   print(col)

a_new
b

In [137]:
for key,value in df.iteritems():
   print(key,value)

a_new 0    1.0
1    3.0
2    9.0
3    5.0
4    6.0
0    NaN
1    7.0
Name: a_new, dtype: float64
b 0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
0    6.0
1    8.0
Name: b, dtype: float64

In [140]:
for _index,row in df.iterrows():
   #print(_index,row)
    print('a value --->',row['a_new'])

a value ---> 1.0
a value ---> 3.0
a value ---> 9.0
a value ---> 5.0
a value ---> 6.0
a value ---> nan
a value ---> 7.0

In [141]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a_new=1.0, b=2.0)
Pandas(Index=1, a_new=3.0, b=nan)
Pandas(Index=2, a_new=9.0, b=nan)
Pandas(Index=3, a_new=5.0, b=nan)
Pandas(Index=4, a_new=6.0, b=nan)
Pandas(Index=0, a_new=nan, b=6.0)
Pandas(Index=1, a_new=7.0, b=8.0)

In [142]:
for index, row in df.iterrows():
   row['b'] = 10

In [143]:
df

   a_new     b
0    1.0  10.0
1    3.0  10.0
2    9.0  10.0
3    5.0  10.0
4    6.0  10.0
0    NaN  10.0
1    7.0  10.0

__sorting__

In [9]:
d = {'Name':pd.Series(['a','b','c','d','e','f','g',
   'h','i','j','k','l']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,6.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.23,3.65])
}
df = pd.DataFrame(d,index=[1,4,6,2,3,5,9,8,0,7,11,10])
df

   Name  Age  Rating
1     b   26    6.24
4     e   30    3.20
6     g   23    3.80
2     c   25    3.98
3     d   23    2.56
5     f   29    4.60
9     j   30    4.80
8     i   40    2.98
0     a   25    4.23
7     h   34    3.78
11    l   46    3.65
10    k   51    4.23

In [4]:
df.sort_index()

   Name  Age  Rating
0     a   25    4.23
1     b   26    6.24
2     c   25    3.98
3     d   23    2.56
4     e   30    3.20
5     f   29    4.60
6     g   23    3.80
7     h   34    3.78
8     i   40    2.98
9     j   30    4.80
10    k   51    4.10
11    l   46    3.65

In [5]:
df.sort_index(ascending=False)

   Name  Age  Rating
11    l   46    3.65
10    k   51    4.10
9     j   30    4.80
8     i   40    2.98
7     h   34    3.78
6     g   23    3.80
5     f   29    4.60
4     e   30    3.20
3     d   23    2.56
2     c   25    3.98
1     b   26    6.24
0     a   25    4.23

In [6]:
df.sort_index(axis=1)

    Age Name  Rating
1    26    b    6.24
4    30    e    3.20
6    23    g    3.80
2    25    c    3.98
3    23    d    2.56
5    29    f    4.60
9    30    j    4.80
8    40    i    2.98
0    25    a    4.23
7    34    h    3.78
11   46    l    3.65
10   51    k    4.10

In [7]:
df.sort_values(by='Rating')

   Name  Age  Rating
3     d   23    2.56
8     i   40    2.98
4     e   30    3.20
11    l   46    3.65
7     h   34    3.78
6     g   23    3.80
2     c   25    3.98
10    k   51    4.10
0     a   25    4.23
5     f   29    4.60
9     j   30    4.80
1     b   26    6.24

In [10]:
df.sort_values(by=['Rating','Age'])

   Name  Age  Rating
3     d   23    2.56
8     i   40    2.98
4     e   30    3.20
11    l   46    3.65
7     h   34    3.78
6     g   23    3.80
2     c   25    3.98
0     a   25    4.23
10    k   51    4.23
5     f   29    4.60
9     j   30    4.80
1     b   26    6.24

__text data__

In [29]:
s = pd.Series(['Alok   ', '   Rick', 'John', 'P@ssword', np.nan, '1234','Hero','John'])
s

0     Alok
1        Rick
2        John
3    P@ssword
4         NaN
5        1234
6        Hero
7        John
dtype: object

In [19]:
s.str.lower()

0     alok
1        rick
2        john
3    p@ssword
4         NaN
5        1234
6        hero
dtype: object

In [20]:
s.str.upper()

0     ALOK
1        RICK
2        JOHN
3    P@SSWORD
4         NaN
5        1234
6        HERO
dtype: object

In [16]:
df['Name']=df['Name'].str.upper()
df

   Name  Age  Rating
1     B   26    6.24
4     E   30    3.20
6     G   23    3.80
2     C   25    3.98
3     D   23    2.56
5     F   29    4.60
9     J   30    4.80
8     I   40    2.98
0     A   25    4.23
7     H   34    3.78
11    L   46    3.65
10    K   51    4.23

In [23]:
s.str.len()

0    7.0
1    7.0
2    4.0
3    8.0
4    NaN
5    4.0
6    4.0
dtype: float64

In [22]:
s.str.strip()

0        Alok
1        Rick
2        John
3    P@ssword
4         NaN
5        1234
6        Hero
dtype: object

In [24]:
s.str.split(' ')

0    [Alok, , , ]
1    [, , , Rick]
2          [John]
3      [P@ssword]
4             NaN
5          [1234]
6          [Hero]
dtype: object

In [25]:
s.str.cat(sep='_')

'Alok   _   Rick_John_P@ssword_1234_Hero'

In [30]:
s.str.get_dummies()

      Rick  1234  Alok     Hero  John  P@ssword
0        0     0        1     0     0         0
1        1     0        0     0     0         0
2        0     0        0     0     1         0
3        0     0        0     0     0         1
4        0     0        0     0     0         0
5        0     1        0     0     0         0
6        0     0        0     1     0         0
7        0     0        0     0     1         0

In [31]:
s.str.contains(' ')

0     True
1     True
2    False
3    False
4      NaN
5    False
6    False
7    False
dtype: object

In [32]:
s.str.replace('@','$')

0     Alok
1        Rick
2        John
3    P$ssword
4         NaN
5        1234
6        Hero
7        John
dtype: object

In [34]:
s.str.count('e')

0    0.0
1    0.0
2    0.0
3    0.0
4    NaN
5    0.0
6    1.0
7    0.0
dtype: float64

In [35]:
s.str.find('e')

0   -1.0
1   -1.0
2   -1.0
3   -1.0
4    NaN
5   -1.0
6    1.0
7   -1.0
dtype: float64

In [36]:
s.str.findall('e')

0     []
1     []
2     []
3     []
4    NaN
5     []
6    [e]
7     []
dtype: object

In [37]:
s.str.isnumeric()

0    False
1    False
2    False
3    False
4      NaN
5     True
6    False
7    False
dtype: object

In [44]:
pd.get_option("display.max_rows")

60

In [39]:
pd.get_option("display.max_columns")

20

In [40]:
pd.set_option("display.max_rows",80)

In [41]:
pd.set_option("display.max_columns",30)

In [43]:
pd.reset_option("display.max_rows")

In [45]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
  'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)

In [48]:
df.loc[:,'one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [49]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a -0.034684 -0.617725  1.044142 -0.177578
b -0.139721 -2.257521  1.160711  1.021151
c  2.811645 -0.041142 -0.245050 -0.973485
d -0.052901  0.719716  0.148150 -0.657356
e -1.458468 -0.787145  1.167157 -1.073071
f -0.541678  0.866919  0.328021 -0.863620
g  0.829808 -2.091436  1.520821  0.715112
h -0.694248 -1.274919  1.268711 -0.490004

In [50]:
df.loc[:,['A','C']]

          A         C
a -0.034684  1.044142
b -0.139721  1.160711
c  2.811645 -0.245050
d -0.052901  0.148150
e -1.458468  1.167157
f -0.541678  0.328021
g  0.829808  1.520821
h -0.694248  1.268711

In [51]:
df.loc[['a','b','f','h'],['A','C']]

          A         C
a -0.034684  1.044142
b -0.139721  1.160711
f -0.541678  0.328021
h -0.694248  1.268711

In [52]:

# Select range of rows for all columns
df.loc['a':'h']

          A         B         C         D
a -0.034684 -0.617725  1.044142 -0.177578
b -0.139721 -2.257521  1.160711  1.021151
c  2.811645 -0.041142 -0.245050 -0.973485
d -0.052901  0.719716  0.148150 -0.657356
e -1.458468 -0.787145  1.167157 -1.073071
f -0.541678  0.866919  0.328021 -0.863620
g  0.829808 -2.091436  1.520821  0.715112
h -0.694248 -1.274919  1.268711 -0.490004

In [55]:
# for getting values with a boolean array of any inxed
df.loc['a']>0

A    False
B    False
C     True
D    False
Name: a, dtype: bool

In [56]:
df.iloc[:4]

          A         B         C         D
a -0.034684 -0.617725  1.044142 -0.177578
b -0.139721 -2.257521  1.160711  1.021151
c  2.811645 -0.041142 -0.245050 -0.973485
d -0.052901  0.719716  0.148150 -0.657356

In [57]:
df.iloc[1:5, 2:4]

          C         D
b  1.160711  1.021151
c -0.245050 -0.973485
d  0.148150 -0.657356
e  1.167157 -1.073071

In [59]:
# Slicing through list of values
df.iloc[[1, 3, 5], [1, 3]]
#df.iloc[1:3, :]
#df.iloc[:,1:3]

          B         D
b -2.257521  1.021151
d  0.719716 -0.657356
f  0.866919 -0.863620

In [61]:
df['A']

a   -0.034684
b   -0.139721
c    2.811645
d   -0.052901
e   -1.458468
f   -0.541678
g    0.829808
h   -0.694248
Name: A, dtype: float64

In [62]:
df[['A','B']]

          A         B
a -0.034684 -0.617725
b -0.139721 -2.257521
c  2.811645 -0.041142
d -0.052901  0.719716
e -1.458468 -0.787145
f -0.541678  0.866919
g  0.829808 -2.091436
h -0.694248 -1.274919

In [64]:
df[1:2]

          A         B         C         D
b -0.139721 -2.257521  1.160711  1.021151

In [67]:
df.A

a   -0.034684
b   -0.139721
c    2.811645
d   -0.052901
e   -1.458468
f   -0.541678
g    0.829808
h   -0.694248
Name: A, dtype: float64

In [68]:
df = pd.DataFrame(np.random.randn(5, 2))
df.pct_change() #default on column

          0         1
0       NaN       NaN
1 -0.137161 -1.198242
2 -0.834744 -0.478216
3 -7.641316 -0.596105
4 -1.088278 -1.510898

In [69]:
df.pct_change(axis=1) #on row

    0         1
0 NaN  0.405736
1 NaN -1.322976
2 NaN -2.019776
3 NaN -0.937982
4 NaN -0.641079

In [72]:
s = pd.Series([1,3,2,3,5], index=list('abcde'))
s
#s['d'] = s['b'] # so there's a tie [mean rank]

a    1
b    3
c    2
d    3
e    5
dtype: int64

In [82]:
s.rank()

a    1.0
b    3.5
c    2.0
d    3.5
e    5.0
dtype: float64

In [3]:
#rolling
df = pd.DataFrame(np.random.randn(10, 4),
   index = pd.date_range('1/1/2000', periods=10),
   columns = ['A', 'B', 'C', 'D'])

In [6]:
print(df.rolling(window=3).mean())

                   A         B         C         D
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03 -0.012310  0.182988 -0.882472  0.221713
2000-01-04 -0.280532  0.070125 -0.336368 -0.411403
2000-01-05  0.822059 -0.277943 -0.143723 -0.429518
2000-01-06 -0.009734 -0.275874  0.178814  0.061587
2000-01-07  0.369801 -0.410473  0.475165 -0.449096
2000-01-08 -0.191839 -0.291075  0.369177 -0.567581
2000-01-09 -0.107787 -0.382874  0.375319  0.137772
2000-01-10 -0.633209 -0.743093  0.198308  0.476093

In [22]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [12]:
df[df['one'].isnull()]
df[df['one'].notnull()]

        one       two     three
a  1.112308 -0.273812 -0.968738
c  0.280019  0.887669  0.060781
e  0.604766 -1.242391 -0.013542
f  0.822743  0.365663 -0.696283
h  0.783926  0.020441  1.199488

In [13]:
df['one'].sum()

3.603762051929028

In [14]:
df.fillna(0)

        one       two     three
a  1.112308 -0.273812 -0.968738
b  0.000000  0.000000  0.000000
c  0.280019  0.887669  0.060781
d  0.000000  0.000000  0.000000
e  0.604766 -1.242391 -0.013542
f  0.822743  0.365663 -0.696283
g  0.000000  0.000000  0.000000
h  0.783926  0.020441  1.199488

In [21]:
df

        one       two     three
a -1.242116  0.938952  0.890920
b       NaN       NaN       NaN
c  1.675116 -0.581317 -0.569060
d       NaN       NaN       NaN
e  1.097274 -0.280436  0.561456
f  1.826140  0.975345 -0.645918
g       NaN       NaN       NaN
h  0.787960 -0.821142 -1.504183

In [17]:
df.fillna(method='ffill')

        one       two     three
a -0.512482  1.465556  0.545891
b -0.512482  1.465556  0.545891
c  1.739734  0.859141  0.049510
d  1.739734  0.859141  0.049510
e  1.141765 -0.041784 -0.945607
f  0.235501 -0.802967  0.727125
g  0.235501 -0.802967  0.727125
h  0.308131  1.267544 -0.024605

In [20]:
df.fillna(method='bfill')

        one       two     three
a -1.242116  0.938952  0.890920
b  1.675116 -0.581317 -0.569060
c  1.675116 -0.581317 -0.569060
d  1.097274 -0.280436  0.561456
e  1.097274 -0.280436  0.561456
f  1.826140  0.975345 -0.645918
g  0.787960 -0.821142 -1.504183
h  0.787960 -0.821142 -1.504183

In [23]:
df.dropna()

        one       two     three
a -1.757605 -1.279068 -0.839485
c -0.235399 -0.557442 -0.373447
e -0.319124  1.281462 -0.857304
f  0.513723 -1.110505  0.245004
h -0.725328 -0.238927  0.461690

In [24]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [25]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})

In [27]:
df.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [28]:
#group by
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(data)

In [29]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [33]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [37]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [35]:
grouped = df.groupby('Year')

for name,group in grouped:
   print(name)
   print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [41]:
grouped = df.groupby('Year')
print(grouped.get_group(2014))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fdc50051350>
(2014,      Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804)
(2016,      Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694)
(2017,       Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690)
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [42]:
grouped = df.groupby('Year')
print(grouped['Points'].agg(np.mean))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [43]:
grouped = df.groupby('Team')
print(grouped['Points'].agg([np.sum, np.mean, np.std]))

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

In [44]:
print( df.groupby('Team').filter(lambda x: len(x) >= 3))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [ ]:
#merge
pd.merge(left, right, how='inner', left_on=None, right_on=None,
left_index=False, right_index=False, sort=True)

In [3]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alok', 'Amy', 'Allen', 'Apple', 'Ayou'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [4]:
left

   id   Name subject_id
0   1   Alok       sub1
1   2    Amy       sub2
2   3  Allen       sub4
3   4  Apple       sub6
4   5   Ayou       sub5

In [5]:
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [6]:
print(pd.merge(left,right,on='id'))

   id Name_x subject_id_x Name_y subject_id_y
0   1   Alok         sub1  Billy         sub2
1   2    Amy         sub2  Brian         sub4
2   3  Allen         sub4   Bran         sub3
3   4  Apple         sub6  Bryce         sub6
4   5   Ayou         sub5  Betty         sub5

In [7]:
#Merge Two DataFrames on Multiple Keys
print(pd.merge(left,right,on=['id','subject_id']))

   id Name_x subject_id Name_y
0   4  Apple       sub6  Bryce
1   5   Ayou       sub5  Betty

In [8]:
print(pd.merge(left, right, on='subject_id', how='left'))

   id_x Name_x subject_id  id_y Name_y
0     1   Alok       sub1   NaN    NaN
1     2    Amy       sub2   1.0  Billy
2     3  Allen       sub4   2.0  Brian
3     4  Apple       sub6   4.0  Bryce
4     5   Ayou       sub5   5.0  Betty

In [9]:
print( pd.merge(left, right, on='subject_id', how='right'))

   id_x Name_x subject_id  id_y Name_y
0   2.0    Amy       sub2     1  Billy
1   3.0  Allen       sub4     2  Brian
2   4.0  Apple       sub6     4  Bryce
3   5.0   Ayou       sub5     5  Betty
4   NaN    NaN       sub3     3   Bran

In [10]:
print(pd.merge(left, right, how='outer', on='subject_id'))

   id_x Name_x subject_id  id_y Name_y
0   1.0   Alok       sub1   NaN    NaN
1   2.0    Amy       sub2   1.0  Billy
2   3.0  Allen       sub4   2.0  Brian
3   4.0  Apple       sub6   4.0  Bryce
4   5.0   Ayou       sub5   5.0  Betty
5   NaN    NaN       sub3   3.0   Bran

In [11]:
print(pd.merge(left, right, on='subject_id', how='inner'))

   id_x Name_x subject_id  id_y Name_y
0     2    Amy       sub2     1  Billy
1     3  Allen       sub4     2  Brian
2     4  Apple       sub6     4  Bryce
3     5   Ayou       sub5     5  Betty

In [ ]:
#Concatenating Objects
pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)

In [12]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [13]:
print(pd.concat([one,two]))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [15]:
print(pd.concat([one,two],ignore_index=True))

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [16]:
print(pd.concat([one,two],axis=1))

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

In [17]:
print(one.append(two))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [18]:
print(one.append([two,one,two]))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [10]:
dates_df = pd.date_range('2021-01-01', '2022-10-31', freq='1Q')

In [11]:
dates_df

DatetimeIndex(['2021-03-31', '2021-06-30', '2021-09-30', '2021-12-31',
               '2022-03-31', '2022-06-30', '2022-09-30'],
              dtype='datetime64[ns]', freq='Q-DEC')

In [12]:
date_df = pd.DataFrame(dates_df, columns=['rprt_date'])

In [13]:
date_df

   rprt_date
0 2021-03-31
1 2021-06-30
2 2021-09-30
3 2021-12-31
4 2022-03-31
5 2022-06-30
6 2022-09-30

In [17]:
dates_df = date_df.append([date_df]).sort_values(by='rprt_date').reset_index(drop=True).join(
    pd.DataFrame(['con', 'sa'] * len(date_df), columns=['stmt_type']))

In [18]:
dates_df

    rprt_date stmt_type
0  2021-03-31       con
1  2021-03-31        sa
2  2021-06-30       con
3  2021-06-30        sa
4  2021-09-30       con
5  2021-09-30        sa
6  2021-12-31       con
7  2021-12-31        sa
8  2022-03-31       con
9  2022-03-31        sa
10 2022-06-30       con
11 2022-06-30        sa
12 2022-09-30       con
13 2022-09-30        sa

In [47]:
yr_df = pd.date_range('2022-01-30', '2022-12-31', freq='M')

In [48]:
print(pd.DataFrame(yr_df, columns=['rprt_date']))

    rprt_date
0  2022-01-31
1  2022-02-28
2  2022-03-31
3  2022-04-30
4  2022-05-31
5  2022-06-30
6  2022-07-31
7  2022-08-31
8  2022-09-30
9  2022-10-31
10 2022-11-30
11 2022-12-31

In [53]:
#excel
import xlrd

def get_sheets_name(file_path):
    with xlrd.open_workbook(file_path, on_demand=True) as xls:
        xls_sheet_names = xls.sheet_names()
        print(xls_sheet_names)
    return xls_sheet_names

In [1]:
#sheet_names = get_sheets_name('XXX.xlsx')

In [2]:

df = pd.DataFrame()
for sheet_name in sheet_names:
    if sheet_name == 'any_sheet_name':
        xls = pd.ExcelFile('XXX.xlsx')
        df = pd.read_excel(xls, sheet_name)

NameError: name 'pd' is not defined

In [15]:
min(date_df['rprt_date'])

Timestamp('2021-03-31 00:00:00')